Revit 2027 API
HermiteSplineTangents Properties
The HermiteSplineTangents type exposes the following members.
Properties
Name | Description
EndTangent |  The tangent vector at the end of the curve.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartTangent |  The tangent vector at the start of the curve.
Top
See Also
Reference
HermiteSplineTangents Class
Autodesk.Revit.DB Namespace